Repository: Battmobility/dart_auth
Catalog: lib/l10n/intl_*.arb
Languages: nl

# loginTitle
source: Log in
nl: Meld je aan

# genericCancelLabel
source: Cancel
nl: Annsuleren

# passwordFieldTitle
source: Password
nl: Wachtwoord

# loginErrorShortUsername
source: Username must be at least 6 characters long
nl: Gebruikersnaam moet minstens 6 karakters lang zijn

# loginErrorShortPassword
source: Password must be at least 8 characters long
nl: Wachtwoord moet minstens 8 karakters lang zijn

# forgotPasswordLabel
source: Forgot password?
nl: Wachtwoord vergeten?

# loginErrorMessage
source: Something went wrong while trying to log in. Please ensure you are connected to the internet and try again.
nl: Er ging iets verkeerd bij het aanmelden. Gelieve te controleren of je verbinding hebt met internet en probeer daarna opnieuw.

# createAccountLabel
source: No account yet?
nl: Nog geen account?

# useAccountLabel
source: Already a member?
nl: Al een account?

# createAccountTitle
source: Create account
nl: Word Batt

# createAccountButtonTitle
source: Create
nl: Maak account

# choosePasswordFieldTitle
source: Choose password
nl: Kies wachtwoord

# createAccountSuccessMessage
source: A link to verify your email address was sent to {email}. Please check your spam folder as well.
nl: Er werd een link om het emailadres te bevestigen verstuurd naar {email}.

# createAccountTandCLabelPt1
source: I agree with the
nl: Ik ga akkoord met de

# createAccountTandCLabelToC
source: Terms of Use
nl: Gebruikersovereenkomst

# createAccountTandCLabelPt2
source: and the
nl: en de

# createAccountTandCLabelPP
source: Privacy policy.
nl: Privacyvoorwaarden.

# createAccountMustAcceptTermsMessage
source: You must accept our terms to become a member.
nl: Je moet onze voorwaarden accepteren om lid te kunnen worden.

# createAccountFailureMessage
source: Sorry, there was an error creating your account. If the problem persists, please contact support.
nl: Sorry, er was een probleem bij het aanmaken van een account. Probeer later nogmaals of neem contact op met onze klantendienst.

# resetPasswordTitle
source: Reset password
nl: Stel wachtwoord opnieuw in

# resendVerificationEmailTitle
source: Resend verification email
nl: Stuur verificatie email opnieuw

# resendVerificationEmailConfirmationDialogTitle
source: Verification email re-sent to {email}.
nl: Verificatie mail opnieuw verstuurd naar {email}.

# resendVerificationEmailFailureDialogTitle
source: Failed to re-send verification email
nl: Verificatie mail opnieuw versturen mislukt.

# resetPasswordLabel
source: Enter the email address associated with your account to reset the password.
nl: Voer het emailadres van je account in om je wachtwoord opnieuw in te stellen.

# resetPasswordButtonTitle
source: Reset
nl: Stel opnieuw in

# resetPasswordSuccessMessage
source: A link to reset the password was sent to {email}.
nl: Er werd een link om het wachtwoord opnieuw in te stellen verstuurd naar {email}.

# resetPasswordFailureMessage
source: Sorry, there was an error resetting your password. If the problem persists, please contact support.
nl: Sorry, er was een probleem bij het opnieuw instellen. Probeer later nogmaals of neem contact op met onze klantendienst.

# passwordSafetyConfirmationMessage
source: I have saved my password in a safe place so I can use it to login to the mobile application later.
nl: Ik heb mijn wachtwoord op een veilige plaats bewaard zodat ik het later kan gebruiken om in te loggen op de mobiele applicatie.

# passwordSafetyMustConfirmMessage
source: You must confirm that you have saved your password.
nl: Je moet bevestigen dat je je wachtwoord hebt bewaard.
